const CHAR_MAPS = [
    'à|à', 'á|á', 'ả|ả', 'ạ|ạ', 'ã|ã',
    'è|è', 'ẻ|ẻ', 'ẽ|ẽ', 'é|é', 'ẹ|ẹ',
    'ì|ì', 'ỉ|ỉ', 'ĩ|ĩ', 'í|í', 'ị|ị',
    'ù|ù', 'ủ|ủ', 'ũ|ũ', 'ú|ú', 'ụ|ụ',
    'ỳ|ỳ', 'ỷ|ỷ', 'ỹ|ỹ', 'ý|ý', 'ỵ|ỵ',
    'â|â', 'ấ|ấ', 'ầ|ầ', 'ẩ|ẩ', 'ẫ|ẫ', 'ậ|ậ',
    'ă|ă', 'ằ|ằ', 'ẳ|ẳ', 'ẵ|ẵ', 'ắ|ắ', 'ặ|ặ',
    'ê|ê', 'ế|ế', 'ề|ề', 'ể|ể', 'ễ|ễ', 'ệ|ệ',
    'ò|ò', 'ờ|ờ', 'ỏ|ỏ', 'õ|õ', 'ó|ó', 'ọ|ọ', 
    'ô|ô', 'ồ|ồ', 'ổ|ổ', 'ỗ|ỗ', 'ố|ố', 'ộ|ộ',
    'ơ|ơ', 'ờ|ờ', 'ở|ở', 'ỡ|ỡ', 'ớ|ớ', 'ợ|ợ',
    'ư|ư', 'ừ|ừ', 'ử|ử', 'ữ|ữ', 'ứ|ứ', 'ự|ự',
    'À|À', 'Ả|Ả', 'Ã|Ã', 'Á|Á', 'Ạ|Ạ',
    'È|È', 'Ẻ|Ẻ', 'Ẽ|Ẽ', 'É|É', 'Ẹ|Ẹ',
    'Ì|Ì', 'Ỉ|Ỉ', 'Ĩ|Ĩ', 'Í|Í', 'Ị|Ị',
    'Ù|Ù', 'Ủ|Ủ', 'Ũ|Ũ', 'Ú|Ú', 'Ụ|Ụ',
    'Ỳ|Ỳ', 'Ỷ|Ỷ', 'Ỹ|Ỹ', 'Ý|Ý', 'Ỵ|Ỵ',
    'Â|Â', 'Ầ|Ẩ', 'Ẩ|Ẫ', 'Ẫ|Ẫ', 'Ấ|Ấ', 'Ậ|Ậ',
    'Ă|Ă', 'Ẳ|Ẳ', 'Ẵ|Ẵ', 'Ắ|Ắ', 'Ặ|Ặ',
    'Ê|Ê', 'Ề|Ề', 'Ể|Ể', 'Ễ|Ễ', 'Ế|Ế', 'Ệ|Ệ',
    'Ô|Ô', 'Ồ|Ồ', 'Ổ|Ổ', 'Ỗ|Ỗ', 'Ố|Ố', 'Ộ|Ộ',
    'Ơ|Ơ', 'Ờ|Ờ', 'Ở|Ở', 'Ỡ|Ỡ', 'Ớ|Ớ', 'Ợ|Ợ',
    'Ư|Ư', 'Ừ|Ừ', 'Ử|Ử', 'Ữ|Ữ', 'Ứ|Ứ', 'Ự|Ự',
];

const store = CHAR_MAPS.map(pair => {
    let splitter = pair.split('|');
    return {
        ms: splitter[0],
        unicode: splitter[1]
    };
});

module.exports = (str) => {
    let converted = str;
    let i = store.length;
    while (i--) {
        let replacer = store[i];
        converted = converted.replace(new RegExp(replacer.ms, 'g'), replacer.unicode); //?
    }
    return converted;
};
